Repository: jsn/rbot
Catalog: po/*/rbot.po
Languages: fr, it

source: Password for the bot owner
fr: Mot de passe du maitre du bot
it: Password per il padrone del bot

source: Set false to prevent new botusers from logging in without a password when the user netmask is known
fr: Mettre false pour empêcher les nouveaux utilisateurs de s'enregistrer sans mot de passe lorsque le netmask est connu
it: Impostare a falso per impedire ai nuovi utenti di identificarsi senza password anche se la loro netmask è conosciuta

source: Set false to prevent new botusers from recognizing IRC users without a need to manually login
fr: Mettre false pour empêcher les nouveaux utilisateurs d'être reconnu depuis la liste IRC sans avoir besoin de se logger manuellement d'identifier des utilisateurs d'IRC sans besoin d'ouvrir une session manuellement
it: Impostare a falso per impedire ai nuovi utenti di essere riconosciuti senza prima effettuare il login

source: Set true to allow new botusers to be created automatically
fr: Mettre à true (valide) autorise les nouveaux utilisateurs du bot à être crée automatiquement
it: Impostare a vero per permettere la creazione automatica di nuovi botuser

source: %{user}, you don't have '%{command}' permissions here
fr: %{user}, vous n'avez pas les permissions '%{command}' ici
it: %{user}, non hai i permessi per '%{command}' qui

source: %{desc} [valid values are: %{values}]
fr: %{desc} [valeurs valides: %{values}]
it: %{desc} [valori validi: %{values}]

source: First time rbot configuration wizard
fr: Configuration du premier lancement de rbot
it: Configurazione iniziale di rbot

source: This wizard will ask you a few questions to get you started.
fr: Cet configurateur va vous poser quelques questions pour demarrer.
it: Ti verranno fatte alcune domande per cominciare.

source: The rest of rbot's configuration can be manipulated via IRC once rbot is connected and you are auth'd.
fr: Le reste de la configuration de rbot peut être manipulé via IRC une fois le bot connecté et vous authentifié.
it: Il resto della configurazione di rbot può essere manipolata da IRC quando rbot è connesso e ti sei identificato

source: please do not use + or - in front of command %{command} when resetting
fr: veuillez ne pas utiliser + ou - au debut de la commande %{command} lors du reset
it: non usare + o - davanti al comando %{command} per il reset

source: + or - expected in front of %{string}
fr: + ou - attendu au debut de %{string}
it: + o - atteso prima di %{string}

source: '%{string}' doesn't look like a channel name
fr: '%{string}' ne ressemble pas à un nom de salon
it: '%{string}' non sembra il nome di un canale

source: trailing comma
it: virgola in più

source: you probably forgot a comma
fr: vous avez probablement oublié une virgule
it: probabilmente hai dimenticato una virgola

source: couldn't find botuser %{name}
fr: l'utilisateur %{name} est introuvable
it: impossibile trovare il botuser %{name}

source: you can't change permissions for %{username}
fr: vous ne pouvez pas changer les permissions de %{username}
it: non puoi cambiare i permessi di %{username}

source: couldn't satisfy your request: %{errors}
fr: impossible de traiter votre requete: %{errors}
it: impossibile soddisfare la richiesta: %{errors}

source: you are owner, you can do anything
fr: tu es le propriétaire, fais ce qu'il te plaît
it: sei il padrone, puoi fare tutto

source: owner can do anything
fr: le propriétaire peut tout faire
it: il padrone può fare tutto

source: on any channel:
fr: sur nimporte quel salon:
it: su tutti i canali:

source: in private:
fr: en privé:
it: in privato:

source: no permissions set for %{user}
fr: aucunes permissions établies pour %{user}
it: nessun permesso impostato per %{user}

source: permissions for %{user}:: %{permissions}
fr: permissions pour %{user}:: %{permissions}
it: permessi per %{user}:: %{permissions}

source: . only %{max} will be shown
fr: . seulement %{max} sera affiché
it: . solo %{max} verranno mostrati

source: %{count} commands found matching %{pattern}%{extra}
fr: %{count} commandes trouvés correspondant à %{pattern}%{extra}
it: %{count} comandi trovati corrispondenti a %{pattern}%{extra}

source: %{user} can already do that
fr: %{user} peut déjà faire ceci
it: %{user} può già farlo

source: %{user} can't do that already
fr: %{user} ne peut déja plus faire ceci
it: %{user} già non può farlo

source: sorry, %{cmd} doesn't look like a valid command. maybe you misspelled it, or you need to specify it should be in private?
fr: désolé, %{cmd} ne semble pas être une commande valide. l'avez vous mal écrite, ou vous avez besoin de le spécifier de préference en privé ?
it: spiacente, %{cmd} non sembra un comando valido. forse non è scritto correttamente, o devi specificare che dev'essere in privato?

source: welcome, %{user}
fr: bienvenue, %{user}
it: benvenuto, %{user}

source: sorry, can't do
fr: désolé, je ne peux pas
it: spiacente, non si può

source: couldn't login: %{exception}
fr: impossible de se loguer: %{exception}
it: impossibile effettuare il login: %{exception}

source: I couldn't find anything to let you login automatically
fr: Je ne peux rien trouver pour vous loguer automatiquement
it: non ho trovato nulla con cui farti effettuare il login automatico

source: you are %{who}
fr: vous êtes %{who}
it: sei %{who}

source: no one that I know
fr: pour autant que je sache
it: nessuno di mia conoscenza

source: my boss
fr: mon patron
it: il mio padrone

source: login [<botuser>] [<pass>]: logs in to the bot as botuser <botuser> with password <pass>. When using the full form, you must contact the bot in private. <pass> can be omitted if <botuser> allows login-by-mask and your netmask is among the known ones. if <botuser> is omitted too autologin will be attempted
fr: login [<utilisateur>] [<mot de passe>]: Vous loggue sur le bot sous <utilisateur> avec le mot de passe <mot de passe>. Lorsque vous utilisez la forme complete, vous devez parler au bot en privé. <mot de passe> peut être ommis si <utilisateur> autorise le login-par-masque et votre netmask est connu par le bot. si <utilisateur> est ommis un autologin sera tenté
it: login [<botuser>] [<pass>]: ti identifica col bot come botuser <botuser> usando la password <pass>. Per usare la forma completa devi contattare il bot in privato. <pass> può essere omessa se <botuser> permette il login-by-mask e la tua netmask è tra quelle conosciute. se anche <botuser> viene omesso tenterò il login automatico

source: whoami: names the botuser you're linked to
fr: whoami: nomme l'tilisateur avec lequel vous êtes lié
it: whoami: fornisce il nome del botuser a cui sei identificato

source: who is <user>: names the botuser <user> is linked to
fr: who is <utilisateur>: donne le nom de l'utilisateur avec lequel <utilisateur> est lié
it: who is <utente>: fornisce il nome del botuser a cui è identificato <utente>

source: a permission is specified as module::path::to::cmd; when you want to enable it, prefix it with +; when you want to disable it, prefix it with -; when using the +reset+ command, do not use any prefix
fr: une permission est spécifié comme module::path::to::cmd; lorsque vous voulez l'activer, précédez la d' un +; lorsque vous voulez la desactiver, precedez la avec un - ; lorsque vous utilisez la commande +reset+, veuillez ne pas utiliser de prefixe
it: un permesso viene specificato come modulo::percorso::per::il::comando; per abilitarlo, premetti un +; per disabilitarlo, premetti un -; per reimpostarlo (+reset+) non usare alcun prefisso

source: permissions [re]set <permission> [in <channel>] for <user>: sets or resets the permissions for botuser <user> in channel <channel> (use ? to change the permissions for private addressing)
fr: permissions [re]set <permission> [in <salon>] for <utilisateur>: établit ou remet à zero les permissions pour un utilisateur <utilisateur> sur le salon <salon> (utilisez ? pour changer les permissions en privées)
it: permissions [re]set <permission> [in <channel>] for <user>: imposta o reimposta i permessi per il botuser <user> nel canale <channel> (usa ? per cambiare i permessi delle comunicazioni private)

source: permissions view [for <user>]: display the permissions for user <user>
fr: permissions view [for <utilisateur>]: affiche les permissions de l'utilisateur <utilisateur>
it: permissions view [for <user>]: mostra i permessi per l'utente <user>

source: permissions search <pattern>: display the permissions associated with the commands matching <pattern>
fr: permissions search <pattern>: affiche les permissions associés avec la commande correspondant à <pattern>
it: permissions search <pattern>: mostra i permessi associati ai comandi che corrispondono a <pattern>

source: permission topics: syntax, (re)set, view, search
fr: sujets de permissions: syntax, (re)set, view
it: argomenti di permission: syntax, (re)set, view, search

source: user show <what> : shows info about the user; <what> can be any of autologin, login-by-mask, netmasks
fr: user show <qui> : affiche les informations à propos de l'utilisateur; <qui> peuvent être autologin, login-by-mask, netmasks
it: user show <what>: mostra informazioni sull'utente; <what> può essere autologin, login-by-mask, netmask

source: user enable|disable <what> : turns on or off <what> (autologin, login-by-mask)
fr: user enable|disable <qui> : met on ou off <quit> (autologin, login-by-mask)
it: user enable|disable <what>: abilita o disabilita <what> per l'utente (<what> può essere autologin o login-by-mask)

source: user set password <blah> : sets the user password to <blah>; passwords can only contain upper and lowercase letters and numbers, and must be at least 4 characters long
fr: user set password <mot de passe> : met le mot de passe sur <mot de passe>; le mot de passe ne peut contenir que des lettres minuscules et majuscules ainsi que des nombres, et doit être supérieur à 4 caracteres
it: user set password <blah>: imposta la password per l'utente; la password deve essere lunga almeno 4 caratteri e può contenere solo lettere maiuscole e minuscole, e numeri

source: user add|rm netmask <mask> : adds/removes netmask <mask> from the list of netmasks known to the botuser you're linked to
fr: user add|rm netmask <masque> : ajoute/supprime le netmask <masque> depuis la liste des netmask connus de votre utilisateur
it: user add|rm netmask <mask>: aggiunge o rimuove la netmask <mask> dalla lista delle netmask conosciute dal botuser a cui sei identificato

source: user reset <what> : resets <what> to the default values. <what> can be +netmasks+ (the list will be emptied), +autologin+ or +login-by-mask+ (will be reset to the default value) or +password+ (a new one will be generated and you'll be told in private)
fr: user reset <what> : reset <what> aux valeurs par defaut. <what> peut être un +netmasks+ (the list will be emptied), +autologin+ ou +login-by-mask+ (qui sera remis à zero) ou +password+ (un nouveau sera régénéré et vous sera donné en privé)
it: user reset <what>: reimposta <what> ai valor predefiniti. <what> può essere +netmasks+ (la lista verrà svuotata), +autologin+ o +login-by-mask+ (verranno reimpostati ai valori predefiniti) o +password+ (una nuova password verrà generata e ti verrà comunicata in privato)

source: user tell <who> the password for <botuser> : contacts <who> in private to tell him/her the password for <botuser>
fr: user tell <who> the password for <botuser> : contacte <who> en privé pour lui donner le mot de passe de <botuser>
it: user tell <who> the password for <botuser>: contatta <who> in privato per comunicargli la password per <botuser>

source: user create <name> <password> : create botuser named <name> with password <password>. The password can be omitted, in which case a random one will be generated. The <name> should only contain alphanumeric characters and the underscore (_)
fr: user create <nom> <mot de passe> : crée un utilisateur nommé <name> avec le mot de passe <mot de passe>. Le mot de passe peut être omis, dans ce cas un mot de passe alléatoire sera généré. Le <nom> devrait seulement contenir des caracteres alphanumeriques ou un underscore (_)
it: user create <name> <password>: crea un botuser chiamato <name> con password <password>. La password può essere omessa, nel qual caso ne verrà generata una casuale. <name> può contenere solo caratteri alfanumerici ed il carattere di sottolineatura (_)

source: user list : lists all the botusers
fr: user list : liste tous les utilisateurs
it: user list: elenca i botuser

source: user destroy <botuser> : destroys <botuser>. This function %{highlight}must%{highlight} be called in two steps. On the first call <botuser> is queued for destruction. On the second call, which must be in the form 'user confirm destroy <botuser>', the botuser will be destroyed. If you want to cancel the destruction, issue the command 'user cancel destroy <botuser>'
fr: user destroy <utilisateur> <mot de passe> : détruit <utilisateur>; cette fonction %{highlight}dois%{highlight} être appelée en deux étapes. Premierement aucun mot de passe ne doit être spécifié: <utilisateur> est mis en attente de destruction. Au deuxieme appel, vous devez specifier le bon mot de passe pour <utilisateur>, et il sera detruit. Si vous voulez annuler la destruction, utilise cette commande +user cancel destroy <utilisateur>+
it: user destroy <botuser> : distrugge l'utente <botuser>; questa funzione %{highlight}deve%{highlight} essere chiamata in due passi. Nella prima chiamata <botuser> verrà marcato per la distruzione. Nella seconda chiamata, che deve essere nella forma 'user confirm destroy <botuser>', il botuser verrà distrutto. per annullare la distruzione usa il comando 'user cancel destroy <botuser>'

source: user topics: show, enable|disable, add|rm netmask, set, reset, tell, create, list, destroy
fr: sujets utilisateur: show, enable|disable, add|rm netmask, set, reset, tell, create, list, destroy
it: argomenti per user: show, enable|disable add|rm, netmask, set, reset, tell, create, list, destroy

source: auth <masterpassword>: log in as the bot owner; other commands: login, whoami, permissions syntax, permissions [re]set, permissions view, user, meet, hello, allow, prevent
it: auth <masterpassword>: ti identifica come il padrone del bot; altri comandi: login, whoami, permission syntax, permissions [re]set, permissions view, user, meet, hello, allow, prevent

source: meet <nick> [as <user>]: creates a bot user for nick, calling it user (defaults to the nick itself)
fr: meet <pseudo> [<utilisateur>]: crée un utilisateur nommé pseudo, appellé <utilisateur> (par defaut le pseudo est utilisé)
it: meet <nick> [as <user>]: crea un bot user per il dato nick, chiamandolo user (predefinito: il nick stesso)

source: hello: creates a bot user for the person issuing the command
fr: hello: crée un utilisateur pour la personne ayant tapé la commande
it: hello: crea un botuser per la persona che esegue il comando

source: allow <user> to do <sample command> [<where>]: gives botuser <user> the permissions to execute a command such as the provided sample command
it: abilita <utente> ad eseguire <comando d'esempio> [<dove>]: da' all'utente del bot <utente> i permessi per eseguire un comando come quello fornito come esempio

source: (in private or in channel, according to the optional <where>).
it: (in privato o nel canale, a seconda dell'opzione <dove>).

source: <sample command> should be a full command, not just the command keyword --
it: <comando d'esempio> dovrebbe essere un comand completo, non solo la parola chiave --

source: correct: allow user to do addquote stuff --
it: giusto: allow user to do addquote stuff --

source: wrong: allow user to do addquote.
it: sbagliato: allow user to do addquote.

source: deny <user> from doing <sample command> [<where>]: removes from botuser <user> the permissions to execute a command such as the provided sample command
it: impedisce all'<utente> di esguir <comando d'esempio> [<dove>]: toglie all'utente del bot <botuser>i permessi er eseguire un comando come quello fornito come esempio

source: correct: deny user from doing addquote stuff --
it: giusto: deny user from doing addquote stuff --

source: wrong: deny user from doing addquote.
it: sbagliato: deny user from doing addquote.

source: auth commands: auth, login, whoami, who, permission[s], user, meet, hello, allow, deny
fr: commandes d'auth: auth, login, whoami, who, permission[s], user, meet, hello, allow, deny
it: comandi auth: auth, login, whoami, permission[s], user, neet, hello, allow, deny

source: sorry, I need more arguments to %{command}
fr: désolé, j'ai besoin de plus d'arguments pour %{command}
it: scusa, ma mi servono più argomenti per %{command}

source: I can only %{command} these: %{arguments}
fr: Je peux seulement %{command} avec: %{arguments}
it: posso usare %{command} solo su: %{arguments}

source: no such bot user %{user}
fr: aucun utilisateur %{user}
it: nessun botuser %{user}

source: you can't mess with %{user}
fr: vous ne pouvez pas le bricoler avec un %{user}
it: non puoi alterare %{user}

source: you can't see the properties of %{user}
fr: vous ne pouvez pas voir la propriété de %{user}
it: non puoi vedere le proprietà di %{user}

source: no way I'm telling you the master password!
fr: aucune chance que je vous dise le mot de passe du maitre!
it: non esiste proprio che io ti dica la password del padrone!

source: you can't ask for someone else's password
it: non puoi chiedere la password di qualcun altro

source: c'mon, you can't be asking me seriously to tell you the password in public!
fr: voyons, soyons sérieux, vous ne pouvez pas me demander de dire le mot de passe en publique !
it: non mi stai chiedendo veramente di dirti la passord in pubblico, spero!

source: the password for %{user} is %{password}
fr: le mot de passe de %{user} est %{password}
it: la password per %{user} è %{password}

source: can %{action}
fr: faire %{action}
it: può fare %{action}

source: can not %{action}
fr: impossible de %{action}
it: non può fare %{action}

source: knows no netmasks
fr: aucun netmasks connus
it: non conosce netmask

source: knows %{netmasks}
fr: connus %{netmasks}
it: conosce %{netmasks}

source: you can't change the default user
fr: vous ne pouvez changer l'utilisateur par default
it: non puoi cambiare l'utente predefinito

source: you can't edit %{user}
fr: vous ne pouvez pas éditer %{user}
it: non puoi modificare %{user}

source: I ignored %{things} because %{reason}
fr: J'ai ignoré %{things} a cause de %{reason}
it: ho ignorato %{things} perché %{reason}

source: I haven't changed anything
fr: Je n'ai rien changé
it: non ho cambiato nulla

source: is that a joke? setting the password in public?
fr: c'est une blague? établir le mot de passe en public?
it: scherzi? cambiare la password in pubblico?

source: the password for %{user} is now %{password}
fr: le mot de passe de %{user} est maintenant %{password}
it: la password per %{user} è ora %{password}

source: I can only add/remove netmasks. See +help user add+ for more instructions
fr: Je peux seulement ajouter/supprimer des netmasks. Voyez +help user add+ pour plus d'instructions
it: Posso aggiungere e rimuovere solo le netmask. Vedi anche +help user add+ per ulteriori istruzioni

source: sorry, I don't know how to %{request}
fr: désolé, je ne sais pas comment %{request}
it: spiacente non so come fare %{request}

source: couldn't %{cmd}: %{exception}
fr: impossible %{cmd}: %{exception}
it: impossibile effettuare il login: %{exception}

source: you are now registered as %{buname}. I created a random password for you : %{pass} and you can change it at any time by telling me 'user set password <password>' in private
fr: vous êtes maintenant entrgistré sous %{buname}. J'ai creé un mot de passe alleatoire pour vous: %{pass} vous pouvez le changer n'importe quand en me disant 'user set password <mot de passe>' en privé
it: sei adesso registrato come %{buname}. ho creato una password casuale per te : %{pass} ma puoi cambiarla in qualsiasi momento scrivendomi 'user set password <password>' in privato

source: but I already know %{buname}
fr: mais aussi connu sous %{buname}
it: ma io conosco già %{buname}

source: I had problems meeting %{nick}: %{e}
fr: J'ai des problèmes pour rencontrer %{nick}: %{e}
it: ho problemi a incontrare %{nick}: %{e}

source: couldn't find botuser %{user}
fr: impossible de trouver l'utilisateur %{user}
it: non conosco alcun botuser %{user}

source: I'm not telling the master password to anyone, pal
fr: Je ne donne pas le mot de passe à n'importe qui, mon ami
it: la password del padrone non la dico a nessuno, compare

source: the password for botuser %{user} is %{password}
fr: le mot de passe de l'utilisateur %{user} est %{password}
it: la password per %{user} è %{password}

source: I told %{user} that %{message}
fr: Je viens de dire à %{user} ce message: %{message}
it: ho detto a %{user} che %{message}

source: are you nuts, creating a botuser with a publicly known password?
fr: est tu fou?, créer un utilisateur avec un mot de passe publique?
it: sei scemo, a creare botuser con una password in pubblico?

source: failed to create %{user}: %{exception}
fr: impossible de créer %{user}: %{exception}
it: impossibile creare %{user}: %{exception}

source: created botuser %{user}
fr: utilisateur crée %{user}
it: botuser creato %{user}

source: (queued for destruction)
fr: (dans la queue de destruction)
it: (in coda per la distruzione)

source: I have no botusers other than the default ones
fr: Je n'ai aucun utilisateurs autres que celui de defaut
it: non ho botuser se non i predefiniti

source: You can't destroy %{user}
fr: Vous ne pouvez detruire %{user}
it: non puoi distruggere %{user}

source: no such botuser %{user}
fr: aucun utilisateur %{user}
it: nessun botuser %{user}

source: %{user} removed from the destruction queue
fr: %{user} supprimé de la queue de destruction
it: %{user} rimosso dalla coda per la distruzione

source: %{user} was not queued for destruction
fr: %{user} n'est pas dans la queue de destruction
it: %{user} non era in coda per la distruzione

source: %{user} already queued for destruction, use %{highlight}user confirm destroy %{user}%{highlight} to destroy it
fr: %{user} est déjà dans la queue de destruction, utilise %{highlight}user destroy %{user} <mot de passe>%{highlight} pour le detruire
it: %{user} era già in coda per la distruzione, usa %{highlight}user destroy %{user} <password>%{highlight} per distruggerlo

source: %{user} queued for destruction, use %{highlight}user confirm destroy %{user}%{highlight} to destroy it
fr: %{user} a été mis dans la queue de destruction, utilise %{highlight}user destroy %{user} <mot de passe>%{highlight} pour le detruire
it: %{user} messo in coda per la distruzione, usa %{highlight}user destroy %{user} <password>%{highlight} per distruggerlo

source: %{user} is not queued for destruction yet
fr: %{user} n'est pas encore dans la queue de destruction
it: %{user} non è ancora in coda per la distruzione

source: failed: %{exception}
fr: echec: %{exception}
it: fallito: %{exception}

source: botuser %{user} destroyed
fr: utilisateur %{user} detruit
it: botuser %{user} distrutto

source: please don't touch the default users
fr: veuillez ne pas toucher aux utilisateurs par defaut
it: per favore non toccare gli utenti predefiniti

source: no such botuser %{source}
fr: aucun utilisateur %{source}
it: nessun botuser %{source}

source: botuser %{dest} exists already
fr: utilisateur %{dest} existe déjà
it: il botuser %{dest} esiste già

source: botuser %{source} copied to %{dest}
fr: utilisateur %{source} copié vers %{dest}
it: botuser %{source} copiato in %{dest}

source: botuser %{source} renamed to %{dest}
fr: utilisateur %{source} renommé vers %{dest}
it: botuser %{source} rinominato %{dest}

source: selecting data to export ...
fr: selection des données à exporter ...
it: sto selezionando i dati da esportare ...
