Repository: jsn/rbot
Catalog: po/*/rbot-seen.po
Languages: fi

source: changing nick from %{nick} to %{message}
fi: vaihtamassa nick %{nick} to %{message}

source: leaving %{where} (%{message})
fi: lähtemässä kanavalta %{where} (%{message})

source: leaving %{where}
fi: lähtemässä kanavalta %{where}

source: joining %{where}
fi: liittyessään kanavalle %{where}

source: quitting IRC (%{message})
fi: sulkemassa irkki (%{message})

source: changing the topic of %{where} to "%{message}"
fi: vaihtamassa kanavan %{where} topic: "%{message}"

source: %{nick} was last seen %{when}, %{doing}
fi: %{nick} nähtiin viimeksi %{when} %{doing}

source: %{nick} was last seen %{when}, %{doing} and %{time} before %{did_before}
fi: %{nick} nähtiin viimeksi %{when} %{doing} ja %{time} ennen %{did_before}

source: Maximum number of seen users to return in search (0 = no limit).
fi: Kuinka monta käyttäjää haun tulisi maksimissaan palauttaa (0 = ei rajaa)

source: seen <nick> => have you seen, or when did you last see <nick>
fi: seen <nimi> => kertoo onko ja jos on, niin milloin <nimi> on viimeksi näkynyt

source: nope!
fi: ei ole näkynyt :/

source: a moment
fi: hetkeä

source: a while
fi: jonkun aikaa

source: just now
fi: ihan äsken

source: %{time} ago
fi: %{time} sitten
