Repository: jsn/rbot
Catalog: po/*/rbot-alias.po
Languages: fr

source: Data file is not found or corrupt, reinitializing data
fr: Fichier de donnée non trouvé ou corrompu, reinitialisation des données

source: Invalid alias entry %{alias} : %{command} in %{filename}: %{reason}
fr: Entree d'alias non valide %{alias} : %{command} dans %{filename}: %{reason}

source: The definition you provided is invalid: %{reason}
fr: La definition que vous avez soumis est invalide: %{reason}

source: No such alias is defined
fr: Aucun alias de ce type définis

source: No aliases defined
fr: Aucun alias définis

source: Alias of %{command}
fr: Alias de %{command}

source: The arguments in alias must match the substitutions in command, and vice versa
fr: L'argument dans l'alias dois correspondre avec une substitution de commande, et vice versa

source: Error mapping %{text} as command: %{error}
fr: Erreur en mappant %{text} avec la commande: %{error}

source: The alias seems to have caused infinite recursion. Please examine your alias definitions
fr: L'alias semble avoir causer une recursivite infinie. Veuillez examiner vos definitions d'alias

source: Error handling the alias, The alias %{text} is not defined or has beeen removed. I will stop responding to it after rescan,
fr: Erreur en utilisant l'alias. L'alias %{text} n'est pas definit ou a été supprimé. Je vais arreter de repondre apres avoir rescanné,

source: Create and use aliases for commands. Topics: create, commands
fr: Crée et utilise des alias pour des commandes. Aides: create, commands

source: "alias <text> => <command>" => add text as an alias of command. Text can contain placeholders marked with : or * for :words and *multiword arguments. The command can contain placeholders enclosed with < > which will be substituded with argument values. For example: alias googlerbot *terms => google site:ruby-rbot.org <terms>
fr: "alias <texte> => <commands>" => ajoute le texte comme un alias de la commande. Le texte peut contenir des séparateurs comme : ou * pour les :mots et *multi-arguments. La commande peut contenir des separateurs de delimitation comme < > qui peuvent substitué par des valeurs d'arguments. Par exemple: alias googlerbot *terms => google site:ruby-rbot.org <terms>

source: alias list => list defined aliases | alias whatis <alias> => show definition of the alias | alias remove <alias> => remove defined alias | see the "create" topic about adding aliases
fr: alias list => list defined aliases | alias whatis <alias> => affiche les definitions des alias | alias remove <alias> => supprime l'alias definit | voyez le "create" sujet a propos de l'ajout d'alias
