Repository: jsn/rbot
Catalog: po/*/rbot-wheelfortune.po
Languages: fr, it

source: [Letters called so far: %{red}%{letters}%{nocolor}]
fr: [Lettres utilisés pour le moment: %{red}%{letters}%{nocolor}]
it: [Lettere chiamate finora: %{red}%{letters}%{nocolor}]

source: wof [<channel>] play [<name>] for <single> to <max> => starts a wheel-of-fortune game on channel <channel> (default: current channel), named <name> (default: wheelfortune.game_name config setting, or the last game name used by the user), with <single> points per round. the game is won when a player reachers <max> points. vowels cost <single>*<single>/<max> points. The user that starts the game is the game manager and must set up the clues and answers in private. All the other users have to learn the answer to each clue by saying single consonants or the whole sentence. Every time a consonant is guessed, the bot will reveal the partial answer, showing the missing letters as * (asterisks).
fr: wof [<salon>] play [<nom>] for <simple> to <maximum> => demarre un jeu de la roue de la fortune sur le <salon> (defaut: channel courrant), nommée <nom> (defaut: wheelfortune.game_name parametre de config, ou le nom du dernier jeu utilisé par l'utilisateur), avec <simple> points par tours. le jeu est gagné par le joueur qui atteint les points <maximum>. les voyelles coutent <simple>*<simple>/<maximum> points. L'utilisateur qui demarre le jeu est le gestionnaire du jeu, et dois fixer les indices et reponses en privé. Tout les autres utilisateurs doivent deviner la reponse en donnant une consonne seule ou la phrase entière. A chaque fois qu'une consonne est juste, le bot revele une partie de la reponse, en montrant les lettres manquantes avec un * (asterisque).
it: wof [<canale>] play [<nome>] for <singola> to <max> => avvia una partita di ruota della forunta in <canale> (default: canale corrente), chiamata <nome>(default: valore di config wheelfortune.game_name, o l'ultimo nome usato dall'utente) con <singola> punti per round. vince chi raggiunge <max> punti. le vocali costano <single>*<single>/<max>. L'utente che avvia la partita è il manager e deve impostare indizi e risposte in privato. Tutti gli altri devono indovinare la risposta a ciascun indizio dicendo una singola consonante oppure l'intera frase. Ogni volta che una consonante viene indovinata, il bot rivelerà la risposta parziale, mostrando le lettere mancanti con * (asterisco).

source: wof <channel> [category: <cat>,] clue: <clue>, answer: <ans> => set up a new question for the wheel-of-fortune game being played on channel <channel>. This command must be sent in private by the game manager. The category <cat> can be omitted. If you make mistakes, you can use 'wof replace' (see help) before the question gets asked
fr: wof <salon> [category: <categorie>,] clue: <indice>, answer: <reponse> => met une nouvelle question pour la roue de la fortune en cours dans <salon>. Cette commande dois être envoyée en privé par le gestionnaire du jeu. La categorie <categorie> peut être ommise. Si vous avez fais une erreur, vous pouvez utiliser 'wof replace' (voir l'aide) avant que la question sois dise
it: wof <canale> [category: <cat>,] clue: <indizio>, answer: <risp> => crea una nuova domanda per la partita di ruota della fortuna in corso su <canale>. Questo comando deve essere inviato in privato dal gestore della partita. La categoria <cat> può essere omessa. Se si fanno errori, si può usare 'wof replace' (vedi) prima che la domanda venga chiesta

source: wof <channel> replace <round> [category: <cat>,] [clue: <clue>,] [answer: <ans>] => fix the question for round <round> of the wheel-of-fortune game being played on <channel> by replacing the category and/or clue and/or answer
fr: wof <salon> replace <tour> [category: <categorie>,] [clue: <indice>,] [answer: <reponse>] => met la questions pour le <tour> de la roue de la fortune en cours dans <salon> en replacant la categorie et/ou l'indice et/ou la reponse
it: wof <canale> replace <round> [category: <cat>,] [clue: <indizio>,] [answer: <risp>] => corregge la domanda per il round <round> di ruota della fortuna in corso su <canale> sostituendo la cateogira e/o l'indizio e/o la risposta

source: wof cancel => cancels the wheel-of-fortune being played on the current channel
fr: wof cancel => annulle la roue de la fortune en cours
it: wof cancel => anulla la partita di ruota della fortuna in corso nel canale

source: wof buy <vowel> => buy the vowel <vowel>: the user buying the vowel will lose points equal to the vowel price, and the corresponding vowel will be revealed in the answer (if present)
fr: wof buy <voyelle> => achète la voyelle <voyelle>: l'utilisateur qui l'achète perd les points équivalents au prix de la voyelle, et la voyelle sera révellé dans la reponse (si presente)
it: wof buy <vocale> => compra la vocale <vocale>: l'utente che compra la vocale perte tanti punti quanto è il costo della vocale, e la vocale sarà rivelata nella risposta (se presente)

source: wof: wheel-of-fortune plugin. topics: play, category, clue, answer, replace, cancel, buy
fr: wof: plugin roue de la fortune. aides: play, category, clue, answer, replace, cancel, buy
it: wof: wheel-of-fortune plugin. argomenti: play, category, clue, answer, replace, cancel, buy

source: you must specify a channel
fr: vous devez specifier un salon
it: devi specificare un canale

source: there's already a %{name} game on %{chan}, managed by %{who}
fr: il y a déjà un jeu %{name} sur %{chan}, gérer par %{who}
it: c'è già una partita di %{name} in corso su %{chan}, gestita da %{who}

source: %{who} just created a new %{name} game to %{max} points (%{single} per question, %{price} per vowel)
fr: %{who} viens juste de créer un nouveau jeu %{name} à %{max} points (%{single} par question, %{price} par voyelle)
it: %{who} ha appena creato una partita di %{name} per %{max} punti (%{single} per risposta, %{price} per vocale)

source: ok, the game has been created. now add clues and answers with "wof %{chan} [category: <category>,] clue: <clue>, answer: <ans>". if the clue and answer don't fit in one line, add the answer separately with "wof %{chan} answer <answer>"
fr: ok, le jeu a été crée. maintenant ajoutez des indices et des réponses avec "wof %{chan} [category: <categorie>,] clue: <indice>, answer: <reponse>". si l'indice ne tiens pas sur une ligne, ajoutez la reponse séparement avec "wof %{chan} answer <reponse>"
it: ok, la partita è stata creata. ora aggiungi indizi e risposte con "wof %{chan} [category: <categoria>,] clue: <indizio>, answer: <risp>". se indizio e risposta non rientrano in un rigo, aggiungi la risposta separatamente con "wof %{chan} answer <risposta>"

source: there's no %{name} game running on %{chan}
fr: il n'y a aucuns jeu %{name} en cours sur %{chan}
it: non ci sono partite di %{name} in esecuzione su %{chan}

source: you can't add questions to the %{name} game on %{chan}
fr: vous ne pouvez ajouter une question au jeu %{name} sur %{chan}
it: non puoi aggiungere domande alla partita di %{name} su %{chan}

source: sorry, the answer cannot contain the '*' character
fr: désolé, la reponse ne peut pas contenir le caractère '*'
it: spiacente, la risposta non può contenere il carattere '*'

source: ok, clue added for %{name} round %{count} on %{chan}: %{catclue}
fr: ok, indice ajouté pour %{name} tour %{count} sur %{chan}: %{catclue}
it: ok, indizio aggiunto per %{name} round %{count} su %{chan}: %{catclue}

source: there's already a pending clue for %{name} round %{count} on %{chan}: %{catclue}
fr: il y a déjà un indice en suspend pour %{name} tour %{count} sur %{chan}: %{catclue}
it: c'è già un indizio incompleto per %{name} round %{count} su %{chan}: %{catclue}

source: ok, QA added for %{name} round %{count} on %{chan}: %{catclue} => %{ans}
fr: ok, ajout du QA pour %{name} tour %{count} sur %{chan}: %{catclue} => %{ans}
it: ok, domanda e risposta aggiuna per %{name} round %{count} su %{chan}: %{catclue} => %{ans}

source: there's no pending clue for %{name} on %{chan}!
fr: il n'y a pas d'indices en attendre pour %{name} sur %{chan}!
it: non ci sono indizi incompleti per %{name} su %{chan}!

source: something went wrong, I can't seem to understand what you're trying to set up
fr: quelquechose est faux, je ne peut pas comprendre ce que vous essayez de faire
it: qualcosa è andato storto, non capisco cosa stai cercando di impostare

source: you can't replace questions to the %{name} game on %{chan}
fr: vous ne pouvez remplacer une questions du jeu %{name} sur %{chan}
it: non puoi sostituire le domande per la partita di %{name} su %{chan}

source: there are no questions in the %{name} game on %{chan} which can be replaced
fr: il n'y a aucunes questions dans le jeu %{name} sur %{chan} qui peuvent être remplacées
it: non ci sono domande sostituibili per la partita di %{name} su %{chan}

source: you can only replace questions between rounds %{min} and %{max} in the %{name} game on %{chan}
fr: vous pouvez seulement remplacer les questions entre les tours %{min} et %{max} dans le jeu %{name} sur %{chan}
it: puoi sostituire le domande solo per i round dal %{min} al %{max} nella partita di %{name} su %{chan}

source: ok, replaced QA for %{name} round %{count} on %{chan}: %{catclue} => %{ans}
fr: ok, remplaçons QA pour %{name} tour %{count} sur %{chan}: %{catclue} => %{ans}
it: ok, ho sostituito domanda e risposta per %{name} round %{count} su %{chan}: %{catclue} => %{ans}

source: there are no %{name} questions for %{chan}, I'm waiting for %{who} to add them
fr: il n'y a aucunes %{name} questions pour %{chan}, j'attend que %{who} en ajoute
it: non ci sono domande di %{name} per %{chan}, sto aspettando che %{who} le aggiunga

source: %{bold}%{color}%{name}%{bold}, round %{count}:%{nocolor} %{qa}
fr: %{bold}%{color}%{name}%{bold}, tour %{count}:%{nocolor} %{qa}

source: no scores
fr: aucuns scores
it: nessun punteggio

source: You must buy the %{vowel}
fr: Vous devez acheter le %{vowel}
it: la %{vowel} va comprata

source: %{who} got it! The answer was: %{ans}
fr: %{who} le prend! La reponse etais: %{ans}
it: %{who} ha indovinato! La risposta era: %{ans}

source: %{bold}%{color}%{name}%{bold}%{nocolor}: %{who} %{bold}wins%{bold} after %{count} rounds! The final score is
fr: %{bold}%{color}%{name}%{bold}%{nocolor}: %{who} %{bold}gagne%{bold} après %{count} tours! Le score final est:
it: %{bold}%{color}%{name}%{bold}%{nocolor}: %{who} %{bold}vince%{bold} dopo %{count} round! Il punteggio finale è

source: %{bold}%{color}%{name}%{bold}, round %{count}%{nocolor} -- score so far:
fr: %{bold}%{color}%{name}%{bold}, tour %{count}%{nocolor} -- score pour le moment:
it: %{bold}%{color}%{name}%{bold}, round %{count}%{nocolor} -- punteggi attuali:

source: %{who} buys a %{vowel} for %{price} points
fr: %{who} achète un %{vowel} pour %{price} points
it: %{who} compra una %{vowel} per %{price} punti

source: you can't buy a %{vowel}, %{who}: it costs %{price} points and you only have %{score}
fr: vous ne pouvez pas acheter un %{vowel}, %{who}: cela coute %{price} points et vous avez seulement %{score}
it: non puoi comprare una %{vowel}, %{who}: costa %{price} punti e tu ne hai solo %{score}

source: you can't cancel the current game
fr: vous ne pouvez pas stopper le jeu en cours
it: non puoi annullare questa partita

source: %{name} game cancelled after %{count} rounds. Partial score:
fr: %{name} jeu annulé après %{count} tours. Score partiel:
it: partita di %{name} annullata dopo %{count} round. Punteggi parziali:
