Repository: jsn/rbot
Catalog: po/*/rbot-quotes.po
Languages: fr

source: addquote [<channel>] <quote> => Add quote <quote> for channel <channel>. You only need to supply <channel> if you are addressing %{nick} privately.
fr: addquote [<salon>] <quote> => Ajoute une <quote> pour le salon <salon>. Vous avez seulement besoin de specifier <salon> si vous addressez %{nick} en privé.

source: delquote [<channel>] <num> => delete quote from <channel> with number <num>. You only need to supply <channel> if you are addressing %{nick} privately.
fr: delquote [<salon>] <num> => supprime une quote du <salon> avec le numero <num>. Vous avez seulement besoin de specifier <salon> si vous addressez %{nick} en privé.

source: getquote [<channel>] [<num>] => get quote from <channel> with number <num>. You only need to supply <channel> if you are addressing %{nick} privately. Without <num>, a random quote will be returned.
fr: getquote [<salon>] [<num>] => obtiens une quote depuis <salon> avec le nombre <num>. Vous avez seulement besoin de specifier <salon> si vous addressez %{nick} en privé. Sans <num>, une quote alleatoire sera retournée.

source: searchquote [<channel>] <regexp> => search for quote from <channel> that matches <regexp>. You only need to supply <channel> if you are addressing %{nick} privately.
fr: searchquote [<salon>] <regexp> => cherche une quote du <salon> qui correspond à <regexp>. Vous avez seulement besoin de specifier <salon> si vous addressez %{nick} en privé

source: topicquote [<channel>] [<num>] => set topic to quote from <channel> with number <num>. You only need to supply <channel> if you are addressing %{nick} privately. Without <num>, a random quote will be set.
fr: topicquote [<salon>] [<num>] => met le topic depuis une quote de <salon> avec le nombre <num>. Vous avez seulement besoin de specifier <salon> si vous addressez %{nick} en privé Sans <num>, une quote alleatoire sera mise.

source: countquote [<channel>] <regexp> => count quotes from <channel> that match <regexp>. You only need to supply <channel> if you are addressing %{nick} privately.
fr: countquote [<salon>] <regexp> => compte les quotes du <salon> qui correspondent à <regexp>. Vous avez seulement besoin de specifier <salon> si vous addressez %{nick} en privé

source: whoquote [<channel>] <num> => show who added quote <num>. You only need to supply <channel> if you are addressing %{nick} privately
fr: whoquote [<salon>] <num> => affiche qui a ajouté la quote <num>. Vous avez seulement besoin de specifier <salon> si vous addressez %{nick} en privé

source: whenquote [<channel>] <num> => show when quote <num> was added. You only need to supply <channel> if you are addressing %{nick} privately
fr: whenquote [<salon>] <num> => affiche quand la quote <num> a été ajoutée. Vous avez seulement besoin de specifier <salon> si vous addressez %{nick} en privé

source: quote not found!
fr: quote non trouvée!

source: quote %{num} added by %{source}
fr: quote %{num} ajoutée par %{source}

source: quote %{num} added on %{date}
fr: quote %{num} ajoutée le %{date}

source: %{total} quotes matching %{reg}
fr: %{total} quotes correspondent %{reg}
