Repository: jsn/rbot
Catalog: po/*/rbot-translator.po
Languages: fr

source: Cannot translate empty string
fr: Impossible de traduire une chaine vide

source: Number of seconds to wait for the translation service before timeout
fr: Nombre de secondes a attendre du service de traduction avant le timeout

source: List of translators to try in order when translator name not specified
fr: Liste des traducteurs à essayer dans l'ordre lorsque qu'aucun nom n'est spécifié

source: Translator %{name} cannot be used: %{reason}
fr: Traducteur %{name} ne peut être utilisé: %{reason}

source: %{translator} <from> <to> <phrase> => Look up phrase using %{info}, supported from -> to languages: %{directions}
fr: %{translator} <depuis> <vers> <phrase> => Regarde si une phrase en utilisant %{info}, supprote depuis -> vers langages: %{directions}

source: Command: <translator> <from> <to> <phrase>, where <translator> is one of: %{translators}. If "translator" is used in place of the translator name, the first translator in translator.default_list which supports the specified direction will be picked automatically. Use "help <translator>" to look up supported from and to languages
fr: Commande: <translator> <depuis> <vers> <phrase>, où <translator> est un des: %{translators}. si "translator" est utilisé en place du nom du traducteur, le premier traducteur dans translator.default_list avec le support de la direction de traduction sera pris automatiquement. Utilisez "help <translator>" pour voir les supporte de langues.

source: None of the default translators (translator.default_list) supports translating from %{source} to %{target}
fr: Aucun des traducteurs par defaut (translator.default_list) ne supporte la traduction depuis %{source} vers %{target}

source: %{translation} (provided by %{translator})
fr: %{translation} (fournit par %{translator})

source: %{translator} doesn't support translating from %{source} to %{target}
fr: %{translator} ne supporte pas la traduction depuis %{source} vers %{target}

source: %{translator} failed to provide a translation
fr: %{translator} à été incapable de fournir une traduction

source: The translator timed out
fr: Le traducteur n'a pas repondu

source: No translator called %{name}
fr: Aucun traducteur nommé %{name}
