Repository: jsn/rbot
Catalog: po/*/rbot-factoids.po
Languages: fr, it

source: from %{who}
fr: vous êtes %{who}
it: da %{who}

source: on %{when}
fr: en %{when}
it: il %{when}

source: in %{where}
fr: dans %{where}

source: %{name} (%{fname}) must be under %{dir}
fr: %{name} (%{fname}) dois être dans %{dir}
it: %{name} (%{fname}) deve essere sotto %{dir}

source: %{name} is not a file
fr: %{name} n'est pas un fichier
it: %{name} non è un file

source: fact must be the last field
fr: la fact dois être le dernier champs
it: fact dev'essere l'ultimo campo

source: %{name} (%{fname}) doesn't exist
fr: %{name} (%{fname}) n'existe pas
it: %{name} (%{fname}) non esiste

source: please select a fact number between 1 and %{total}
fr: veuillez selectionner un nombre entre 1 et %{total}
it: per favore seleziona un numero di fatto tra 1 e %{total}

source: I forgot that %{factoid}
fr: J'ai oublier cette %{factoid}
it: ho dimenticato che %{factoid}

source: I couldn't delete factoid %{idx}
fr: Je ne peut pas supprimer la fact %{idx}
it: non sono riuscito a dimenticare il fattoide %{idx}

source: I didn't know that %{factoid}
fr: Je ne connais pas cette %{factoid}
it: non sapevo che %{factoid}

source: I know %{total} facts
fr: Je connais %{total} facts
it: conosco %{total} fatti

source: I know nothing about %{words}
fr: Je ne connais rien à propos de %{word}
it: non so niente circa %{words}

source: %{len} out of %{total} facts refer to %{words}, I'll only show %{max}
fr: %{len} de %{total} facts se referent a %{words}, Je n'en montrerais que %{max}
it: %{len} di %{total} fatti si riferiscono a %{words}, ne mostrerò solo %{max}

source: I know nothing
fr: Je ne connais rien
it: non so niente

source: not a date '%{dstr}'
fr: ce n'est pas une date '%{dstr}'
it: '%{dstr}' non è una data

source: couldn't change learn data for fact %{fact}: %{err}
fr: impossible de changer les données de la fact %{fact}: %{err}
it: non sono riuscito a cambiare i dati per il fatto %{fact}: %{err}

source: failed to import facts from %{fname}: %{err}
fr: impossible d'importer les facts depuis %{fname}: %{err}
it: impossibile importare i fatti da %{fname}: %{err}

source: %{len} facts loaded from %{fname}
fr: %{len} facts chargés depuis %{fname}
it: %{len} fatti caricati da %{fname}
