Repository: jsn/rbot
Catalog: po/*/rbot-azgame.po
Languages: fr, ja

source: %{count} try
fr: %{count} essai
ja: %{count}つのトライ

source: winner, %{tries}
fr: gagnant, %{tries}
ja: （勝者）%{tries}

source: %{bold}BINGO!%{bold} the word was %{underline}%{word}%{underline}. Congrats, %{bold}%{player}%{bold}!
fr: %{bold}BINGO!%{bold} le mot est %{underline}%{word}%{underline}. Felicitation, %{bold}%{player}%{bold}!
ja: %{bold}ビンゴー!%{bold} 秘密の言葉は %{underline}%{word}%{underline} でした。おめでとうございます、%{bold}%{player}%{bold} さん！

source: The game was won after %{tries} tries. Scores for this game: %{scores}
fr: Le jeu a été gagné apres %{tries} essais. Scores pour ce jeu: %{scores}
ja: このゲームが%{tries}つのトライの後勝ちました。スコアは： %{scores} でした。

source: %{word} is not in the range %{bold}%{range}%{bold}
fr: %{word} n'est pas dans cette limite %{bold}%{range}%{bold}
ja: %{word}は%{bold}%{range}%{bold}のレンジ外です。

source: %{word} doesn't exist or is not acceptable for the game
fr: %{word} n'existe pas ou n'est pas acceptable pour ce jeu
ja: 「%{word}」って言葉は存在しませんか、このゲームに入れることができません。

source: close, but no cigar. New range: %{bold}%{range}%{bold}
fr: fermé, mais pas de cigar. Nouvelle limite: %{bold}%{range}%{bold}
ja: レーンジを小さくしました。もっと頑張ってくださいね！新しいレーンジは：%{bold}%{range}%{bold}

source: %{word} is already one of the range extrema: %{range}
fr: %{word} est déjà dans la limite extreme: %{range}
ja: %{word}はいまのレーンジの外れの一つです：%{range}

source: hm, something went wrong while verifying %{word}
fr: hm, quelquechose est faux en verifiant %{word}
ja: %{word}をチェックしたとき何かエラーが発生しました。

source: no A-Z game running here, can't check if %{word} is valid, can I?
fr: aucun jeu A-Z n'est demarrer pour le moment, impossible de verifier si %{word} est valide
ja: 今A-Zのゲームをしていませんから、「%{word}」のチェックができません。

source: I only accept single words composed by letters only, sorry
fr: J'accepte seulement les mot simples composés uniquement de lettres, désolé

source: the word in %{bold}%{range}%{bold} was: %{bold}%{word}%{bold}
fr: le mot dans %{bold}%{range}%{bold} est: %{bold}%{word}%{bold}
ja: %{bold}%{range}%{bold}の以内の秘密の言葉は「%{bold}%{word}%{bold}」でした。

source: The game was cancelled after %{tries} tries. Scores for this game would have been: %{scores}
fr: LE jeu a été annulé après %{tries} essais. Scores pour ce jeu aurraient été: %{scores}
ja: このゲームは%{tries}回のトライの後キャンセルされました。いままでのスコアは %{scores} でした。

source: no A-Z game running in this channel ...
fr: aucun jeu A-Z n'est en cours sur ce salon ...
ja: このチャンネルにはA-Zのゲームを遊んでいません。

source: let me think ...
fr: laisse moi penser ...
ja: 秘密の言葉を考えています・・・

source: couldn't think of anything ...
fr: impossible de penser quelquechose ...
ja: 考えられませんでした・・・

source: got it!
fr: prend le!
ja: わかりました！

source: I can't play A-Z in %{lang}, sorry
fr: Je ne peut jouer à A-Z en %{lang}, désolé
ja: 申し訳ありませんが、%{lang}の言語でA-Zのゲームができません

source: (after %{total_tries} and %{invalid_tries})
fr: (apres %{total_tries} et %{invalid_tries}
ja: (%{total_tries}と%{invalid_tries}の後

source: %{count} invalid try
fr: %{count} essai invalide
ja: %{count}つの間違えたトライ

source: (after %{total_tries})
fr: (après %{total_tries}
ja: (%{total_tries}の後

source: I have %{count} %{lang} word in my cache
fr: J'ai %{count} %{lang} mot en cache
ja: キャッシュには、%{lang}の言葉は%{count}本あります。

source: provide a regexp to match
fr: soummet une regex à comparer

source: no %{lang} word I know match %{pattern}
fr: aucun mot %{lang} correspondant à %{pattern} n'est connu

source: more than 25 %{lang} words I know match %{pattern}, try a stricter matching
fr: plus de 25 mots %{lang} connus correspondent %{pattern}, essayez une recherche plus stricte

source: provide a word
fr: fournit un mot

source: I don't know any %{lang} word %{word}
fr: Je ne connais aucun mot %{word} %{lang}
ja: %{lang} の言葉「%{word}」知っていません。

source: %{word} learned from %{user} on %{date}
fr: %{word} appris par %{user} le %{date}
ja: 「{word}」は %{user} さんに%{date}に教えてもらいました

source: %{word} learned from %{user}
fr: %{word} appris par %{user}
ja: 「{word}」は %{user} さんに教えてもらいました

source: I already know the %{lang} word %{word}
fr: Je connais déjà ce mot %{word} en %{lang}
ja: %{lang} の言葉「%{word}」はもう知っています。

source: az [lang] word [count|list|add|delete] => manage the az wordlist for language lang (defaults to current bot language)
fr: az [lang] word [count|list|add|delete] => gère la liste des mots de l'AZ pour la langue lang (par defaut la langue du bot)

source: az cancel => abort current game
fr: az cancel => annule le jeu en cours
ja: az cancel => いま遊んでいるゲームを終了します

source: az check <word> => checks <word> against current game
fr: az check <word> => verifie <word> pendant le jeu en cours
ja: az check <word> => いま遊んでいるゲームのルールで、<word> をチェックします

source: az topics: play, rules, cancel, manage, check
fr: aides AZ: play, rules, cancel, manage, check
