Repository: jsn/rbot
Catalog: po/*/rbot.po
Languages: fr, it

source: preparing data for export ...
fr: préparation des données à exporter ...
it: preparo i dati da esportare ...

source: failed to prepare data: %{exception}
fr: échec de la préparation des données: %{exception}
it: impossibile preparare i dati: %{exception}

source: exporting to %{file} ...
fr: exportation vers %{file} ...
it: esporto su %{file} ...

source: failed to export users: %{exception}
fr: échec de l'export des utilisateurs: %{exception}
it: impossibile esportare gli utenti: %{exception}

source: done
fr: terminé
it: fatto

source: reading %{file} ...
fr: lecture %{file} ...
it: leggo %{file} ...

source: failed to import from: %{exception}
fr: échec de l'import depuis: %{exception}
it: impossibile importare: %{exception}

source: selecting data to import ...
fr: sélection des données à importer ...
it: seleziono i dati da importare ...

source: parsing data from import ...
fr: analyse des données à importer ...
it: elaboro i dati da importare ...

source: failed to parse data: %{exception}
fr: echec de l'analyse des données: %{exception}
it: impossibile elaborare i dati: %{exception}

source: quit [<message>] => quit IRC with message <message>
fr: quit [<message>] => quitte l'IRC avec le message <message>
it: quit [<messaggio>] => esce da IRC con il messaggio <messaggio>

source: restart => completely stop and restart the bot (including reconnect)
fr: restart => arrête completement le bot et le relance (incluant la reconnection)
it: restart => ferma il bot completamente e lo riavvia (facendolo anche ricollegare)

source: part
fr: part =>quitte le salon en cours
it: esci

source: hide => part all channels
fr: hide =>quitte tous les salons
it: hide => lascia tutti i canali

source: say <channel>|<nick> <message> => say <message> to <channel> or in private message to <nick>
fr: say <channel>|<nick> <message> => dire <message> sur <channel> ou message privé à <nick>
it: say <canale>|<nick> <messaggio> => invia <messaggio> nel <canale> o in unmessagio privato a <nick>

source: action <channel>|<nick> <message> => does a /me <message> to <channel> or in private message to <nick>
fr: action <channel>|<nick> <message> => équivaut à un /me <message> sur <channel> ou en message privé à <nick>
it: action <canale>|<nick> <messaggio> => invia un /me <messaggio> nel <canale> o inmessaggi privato a <nick>

source: quiet [in here|<channel>] => with no arguments, stop speaking in all channels, if "in here", stop speaking in this channel, or stop speaking in <channel>
fr: quiet [in here|<channel>] => sans arguments, silencieux sur tous les salons, si "in here", silencieux sur ce salon ou dans le <channel>
it: quiet [in here|<canale>] => senza argomenti, smette di parlare in tutti i canali, se si specifica "in here", smette di parlare in questo canale, oppure smette di parlare in <canale>

source: talk [in here|<channel>] => with no arguments, resume speaking in all channels, if "in here", resume speaking in this channel, or resume speaking in <channel>
fr: talk [in here|<channel>] => sans arguments, reprend la conversation dans tous les salons, si "in here", reprend la conversation ici ou dans le <channel>
it: talk [in here|<canale>] => senza argomenti, ricomincia a parlare in tutti i canali, se "in here", ricomincia a parlare in questo canale, oppure ricomincia a parlare in <canale>

source: ping => replies with a pong
fr: ping => repond avec un pong
it: ping => risponde con un pong

source: mode <channel> <mode> <nicks> => set channel modes for <nicks> on <channel> to <mode>
fr: mode <channel> <mode> <nicks> => établit les modes du salon pour <nicks> sur <channel> vers <mode>
it: mode <canale> <mode> <nicks> => imposta i modi del canale per <nicks> nel <canale>

source: [%{secs} ago]
it: [%{secs} fa]

source: I'm a v. %{version}%{ago} rubybot%{copyright}%{url}
fr: Je suis rubybot v. %{version}%{ago} rubybot%{copyright}%{url}
it: Sono un rubybot v. %{version}%{ago}%{copyright}%{url}

source: no such module %{module}
fr: aucun module %{module}
it: non esiste alcun modulo %{module}

source: no such config key %{key}
fr: aucune clé de configuration %{key}
it: non esiste una chiave di configurazione %{key}

source: no config key found matching %{r}
fr: aucune clé de configuration trouvée correspondant à %{r}
it: nessuna chiave di configurazione trovata corrispondente a %{r}

source: possible keys: %{kl}
fr: clés possibles: %{kl}
it: chiavi possibili: %{kl}

source: this config change will take effect on the next restart
fr: cette configuration prendra effet au prochain redemarrage du bot
it: questo cambiamente di configurazione richiede un riavvio per diventare effettivo

source: this config change will take effect on the next rescan
fr: cette configuration prendra effet au prochain rafraîchissement du bot
it: questo cambiamente di configurazione richiede un rescan per diventare effettivo

source: failed to set %{key}: %{error}
fr: impossible de mettre %{key}: %{error}
it: impossibile impostare %{key}: %{error}

source: config key %{key} is not an array
fr: la clé de configuration %{key} n'est pas un tableau
it: la chiave di configurazione %{key} non è una lista

source: failed to add %{value} to %{key}: %{error}
fr: impossible d'ajouter %{value} à %{key}: %{error}
it: impossibile aggiungere %{value} a %{key}: %{error}

source: failed to remove %{value} from %{key}: %{error}
fr: impossible de supprimer %{value} depuis %{key}: %{error}
it: impossibile rimuovere %{value} da %{key}: %{errore}

source: saving ...
fr: sauvegarde ...
it: salvataggio in corso ...

source: rescanning ...
fr: rafraîchit ...
it: rescan ...

source: done. %{plugin_status}
fr: terminé. %{plugin_status}
it: fatto. %{plugin_status}

source: config list => list configuration modules, config list <module> => list configuration keys for module <module>
fr: config list => liste de la configuration des modules, config list <module> => liste des clés de configuration du module <module>
it: config list => elenca i moduli di configurazione, config list <modulo> => elenca le chiavi di configurazione per il <modulo>

source: config get <key> => get configuration value for key <key>
fr: config get <clé> => obtient la valeur de la <clé>
it: config get <chiave> => restituisce il valore di configurazione per la <chiave>

source: reset key <key> to the default
fr: reset key <clé> remet la clé à sa valeur d'origine
it: reset key <chiave> => ripristina il valore di default di <chiave>

source: config set <key> <value> => set configuration value for key <key> to <value>
fr: config set <clé> <valeur> => enregistre la <valeur> de la <clé>
it: config set <key> <valore> => assegna a <chiave> il valore di configurazione <valore>

source: config desc <key> => describe what key <key> configures
fr: config desc <clé> => décris ce que la <clé> configure
it: config desc <chiavey> => descrive ciò che la <chiave> configura

source: config add <value> to <key> => add value <value> to key <key> if <key> is an array
it: config add <valore> to <chiave> => aggiunge il <valore> alla <chiave> se la <chiave> è un array

source: config rm <value> from <key> => remove value <value> from key <key> if <key> is an array
fr: config rm <valeur> from <clé> => supprime la <valeur> de la <clé> si <clé> est un tableau
it: config rm <valore> from <chiave> => rimuove <valore> da <chiave> se <chiave> è un array

source: config module - bot configuration. usage: list, desc, get, set, unset, add, rm
fr: config module - configuration du bot. utilisation: list, desc, get, set, unset, add, rm
it: Modulo di configurazione - configurazione del bot. uso: list, desc, get, set, unset, add, rm

source: nick <newnick> => change the bot nick to <newnick>, if possible
fr: nick <pseudo> => change le pseudo en <pseudo>
it: nick <nick> => cerca di cambiare il nick in <nick>

source: status => display some information on the bot's status
fr: status => affiche quelques informations sur le status du bot
it: status => mostra alcune informazioni circa lo stato del bot

source: save => save current dynamic data and configuration
fr: save => sauvegarde les données dynamiques courantes et les données de configuration
it: save => salva i dati dinamici attuali e la configurazione

source: rescan => reload modules and static facts
fr: rescan => recharge les modules et les definitions statiques
it: rescan => effettua il reload dei moduli e dei dati statici

source: version => describes software version
fr: version => affiche la version logicielle
it: version => descrive la versione del software

source: no filters in group %{g}
fr: aucuns filtres dans le groupe %{g}
it: nessun filtro nel gruppo %{g}

source: no known filters
fr: aucuns filtres connus
it: nessun filtro conosciuto

source: known filters:
fr: filtres connus:
it: filtri conosciuti:

source: no known filter groups
fr: aucuns filtres de groupes connus
it: nessun gruppo di filtri conosciuto

source: known filter groups:
fr: fitres de groupes connus:
it: gruppi di filtri conosciuti:

source: no filters match %{pat}
fr: aucuns filtres ne correspond à %{pat}
it: nessun filtro corrispondente a %{pat}

source: filters matching %{pat}:
fr: filtres correspondants à %{pat}:
it: filtri corrispondenti a %{pat}:

source: %{key} data for %{user}: %{data}
fr: %{word} appris par %{user} le %{date}
it: dati %{key} per %{user}: %{data}

source: sorry, no %{key} data for %{user}
fr: désolé, aucune %{key} de donnée pour %{user}
it: spiacente, nessun dato %{key} per %{user}

source: year
fr: année
it: anno

source: years
fr: années
it: anni

source: month
fr: mois
it: mese

source: months
fr: mois
it: mesi

source: day
fr: jour
it: giorno

source: days
fr: jours
it: giorni

source: hour
fr: heure
it: ora

source: hours
fr: heures
it: ore

source: minute
it: minuto

source: minutes
it: minuti

source: second
fr: seconde
it: secondo

source: seconds
fr: secondes
it: secondi

source: and
fr: et
it: e

source: %{d} ago
it: %{d} fa

source: %{m} years
it: %{m} anni

source: %{m} months
it: %{m} mesi

source: %{m} weeks
it: %{m} settimane

source: %{m} days
it: %{m} giorni

source: %{m} hours
it: %{m} ore

source: half an hour
it: mezz'ora

source: an hour
it: un'ora

source: an hour and a half
it: un'ora e mezza

source: %{m} minutes
it: %{m} minuti

source: %{m} seconds
it: %{m} secondi

source: one second
it: un secondo

source: help topics:
fr: sujets d'aide:
it: argomenti:

source: (help <topic> for more info)
fr: (help <sujet> pour plus d'informations)
it: (help <argomento> per ulteriori informazioni)

source: no help for topic %{topic}
fr: aucune aide pour le sujet %{topic}
it: nessun aiuto disponibile su %{topic}

source: Uptime %{up}, %{plug} plugins active, %{sent} lines sent, %{recv} received.
fr: Uptime %{up},%{plug} plugins actifs, %{sent} lignes envoyés, %{recv} recut.
it: Attivo da %{up}, %{plug} plugin attivi, %{sent} righe spedite, %{recv} righe ricevute.

source: incorrect usage, ask for help using '%{command}'
fr: utilisation incorrecte, demandez de l'aide via '%{command}'
it: uso errato, chiedi aiuto con '%{command}'

source: %{count} core module loaded
fr: %{count} core module chargé
it: %{count} moduli di base caricati

source: %{count} core module: %{list}
it: %{count} moduli di base: %{list}

source: no core botmodules loaded
fr: aucuns modules du core de chargé
it: nessun modulo di base caricato

source: %{count} plugin loaded
fr: %{count} plugin chargé
it: %{count} plugin caricati

source: %{highlight}%{count} plugin ignored%{highlight}
fr: %{highlight}%{count} plugin ignoré%{highlight}
it: %{highlight}%{count} plugin ignorati%{highlight}

source: %{highlight}%{count} plugin ignored%{highlight}: use %{bold}%{command}%{bold} to see why
fr: %{highlight}%{count} plugin ignoré%{highlight}: utilisez %{bold}%{command}%{bold} pour voir pourquoi
it: %{highlight}%{count} plugin ignorati%{highlight}: usa %{bold}%{command}%{bold} per vedere perché

source: %{highlight}%{count} plugin failed to load%{highlight}
fr: %{highlight}%{count} plugin impossible à chargé%{highlight}
it: %{highlight}caricamento di %{count} plugin fallito%{highlight}

source: %{highlight}%{count} plugin failed to load%{highlight}: use %{bold}%{command}%{bold} to see why
fr: %{highlight}%{count} plugin impossible à chargé%{highlight}: utilisez %{bold}%{command}%{bold} pour voir pourquoi
it: %{highlight}caricamento di %{count} plugin fallito%{highlight}: usa %{bold}%{command}%{bold} per vedere perché

source: no plugins failed to load
fr: aucuns plugins n'ont échoués au chargement
it: nessun plugin ha fallito il caricamento

source: %{highlight}%{plugin}%{highlight} in %{dir} failed with error %{exception}: %{reason}
fr: %{highlight}%{plugin}%{highlight} dans %{dir} a échoué avec l'erreur %{exception}: %{reason}
it: %{highlight}%{plugin}%{highlight} in %{dir} fallito con errore %{exception}: %{reason}

source: at %{backtrace}
fr: à %{backtrace}
it: in %{backtrace}

source: no plugins were ignored
fr: aucun plugins n'ont été ignoré
it: nessun plugin ignorato

source: overruled by previous
fr: rejeté par le precedent
it: preceduto da un omonimo

source: upgrading old-style (rbot 0.9.5 or earlier) plugin registry to new format
fr: mise à jour du vieux style (rbot 0.9.5 ou plus vieux) de plugin de registre au nouveau format
it: aggiornamento del registro dei plugin (versione 0.9.5 o precedente) al nuovo formato

source: upgrading previous (rbot 0.9.9 or earlier) plugin registry to new split format
fr: mise a jour du (rbot 0.9.9 ou plus vieux) plugin de registre vers le nouveau format divisé
it: aggiornamento del registro dei plugin (versione 0.9.9 o precedente) al nuovo formato

source: marshal recovery failed, trying default
fr: la tentative de récuperation marshal a échoué, essai des defauts
it: recupero dati marshal fallito, tento di usare il valore predefinito

source: botuser: %{list}
fr: utilisateur: %{list}

source: config-related tasks: config, save, rescan, version, nick, status
fr: taches de configuration similaire: config, save, rescan
