Repository: jsn/rbot
Catalog: po/*/rbot-lastfm.po
Languages: fi

source: and %{n} more...
fi: ja %{n} muuta...

source: , where <period> can be one of: 3|6|12 months, a year
fi: , jossa <aikaväli> voi olla: 3|6|12 months, a year

source: lastfm [<num>] events in <location> => show information on events in or near <location>. lastfm [<num>] events by <artist/group> => show information on events by <artist/group>. lastfm [<num>] events at <venue> => show information on events at specific <venue>. The number of events <num> that can be displayed is optional, defaults to %{d} and cannot be higher than %{m}. Append 'sort by <what> [in <order> order]' to sort events. Events can be sorted by attendance or date (default) in ascending or descending order.
fi: lastfm [<määrä>] events in <sijainti> => näytä tietoja tapahtumista sijainnin <sijainti> lähellä. lastfm [<määrä>] events by <artisti/ryhmä> => näytä tietoja artistin tai ryhmän tapahtumista. lastfm [<määrä>] events at <paikka> => näytä tietoja tapahtumista tietyssä paikassa, esim: Hartwall Areena. Tapahtumia näytetään <määrä> määrä. Lisää loppuun 'sort by <asia> [in <järjestys> order] jos haluat järjestää tapahtumia. Tapahtumia voi järjestää osallistujien (= attendance) tai päivämäärän (= date) mukaan, nousevassa (= ascending) tai laskevassa (= descending) järjestyksessä.

source: lastfm artist <name> => show information on artist <name> from last.fm
fi: lastfm artist <nimi> => näytä tietoja artistista <nimi>

source: lastfm album <name> => show information on album <name> from last.fm [not implemented yet]
fi: lastfm album <nimi> => näytä tietoja albumista <nimi> [ei toimi tällä hetkellä]

source: lastfm track <name> => search tracks matching <name> on last.fm
fi: lastfm track <nimi> => etsi kappaletta <nimi> last.fm:stä

source: lastfm now [<nick>] => show the now playing track from last.fm. np [<nick>] does the same.
fi: lastfm now [<nick>] => näytä mitä <nick> kuuntelee, np [<nick>] ajaa saman asian

source: lastfm set user <user> => associate your current irc nick with a last.fm user. lastfm set verb <present>, <past> => set your preferred now playing/just played verbs. default "is listening to" and "listened to".
fi: lastfm set user <käyttäjä> => assosioi irc nickisi last.fm tunnukseesi. lastfm set verb <nykyinen>, <mennyt> => määritä suosimasi verbit kuuntelee/kuunteli tilalle.

source: lastfm who [<nick>] => show who <nick> is on last.fm. if <nick> is empty, show who you are on lastfm.
fi: lastfm who [<nick>] => näytä kuka <nick> on last.fm:ssä, tai jos <nick>:iä ei ole määritelty, näytä kuka itse olet

source: lastfm compare [<nick1>] <nick2> => show musical taste compatibility between nick1 (or user if omitted) and nick2
fi: lastfm compare [<nick1>] <nick2> => näytä käyttäjien musikaalinen yhteensopivuus, tai oma yhteensopivuutesi käyttäjään <nick2>

source: lastfm shouts [<nick>] => show shouts to <nick>
fi: lastfm shouts [<nick>] => näytä huudot käyttäjälle <nick>

source: lastfm friends [<nick>] => show <nick>'s friends
fi: lastfm friends [<nick>] => näytä käyttäjän <nick> ystävät

source: lastfm neighbors [<nick>] => show people who share similar musical taste as <nick>
fi: lastfm neighbors [<nick>] => näytä käyttäjiä joilla on samanlainen musiikkimaku kuin käyttäjällä <nick>

source: lastfm loved[tracks] [<nick>] => show tracks that <nick> has loved
fi: lastfm loved[tracks] [<nick>] => näytä kappaleet joihin <nick> on rakastunut

source: lastfm recent[tracks] [<nick>] => show tracks that <nick> has recently played
fi: lastfm recent[tracks] [<nick>] => näytä käyttäjän <nick> viime aikoina kuuntelemat kappaleet

source: lastfm topalbums [<nick>] [over <period>] => show <nick>'s top albums%{p}
fi: lastfm topalbums [<nick>] [over <period>] => näytä käyttäjän <nick> kuunnelluimmat kappaleet%{p}

source: lastfm topartists [<nick>] [over <period>] => show <nick>'s top artists%{p}
fi: lastfm topartists [<nick>] [over <period>] => näytä käyttäjän <nick> kuunnelluimmat artistit%{p}

source: lastfm toptracks [<nick>] [over <period>] => show <nick>'s top tracks%{p}
fi: lastfm toptracks [<nick>] [over <period>] => näytä käyttäjän <nick> kuunnelluimmat kappaleet%{p}

source: lastfm weeklyalbumchart [<nick>] => show <nick>'s weekly album chart
fi: lastfm weeklyartistchart [<nick>] => näytä käyttäjän <nick> viikottainen albumilista

source: lastfm weeklyartistchart [<nick>] => show <nick>'s weekly artist chart
fi: lastfm weeklyartistchart [<nick>] => näytä käyttäjän <nick> viikottainen artistilista

source: lastfm weeklyartistchart [<nick>] => show <nick>'s weekly track chart
fi: lastfm weeklyartistchart [<nick>] => näytä käyttäjän <nick> viikottainen kappalelista

source: last.fm plugin - topics: events, artist, album, track, now, set, who, compare, shouts, friends, neighbors, (loved|recent)tracks, top(albums|tracks|artists), weekly(album|artist|track)chart
fi: last.fm plugin - aiheet: events, artist, album, track, now, set, who, compare, shouts, friends, neighbors, (loved|recent)tracks, top(albums|tracks|artists), weekly(album|artist|track)chart

source: no events found in %{location}
fi: paikassa %{location} ei ole tapahtumia

source: no events found by %{artist}
fi: artistilla %{artist} ei ole tapahtumia luvassa

source: %{user} is not attending any events
fi: %{user} ei ole ottamassa osaa tapahtumiin

source: could not retrieve events
fi: hankaluuksia tapahtumien noudossa

source: last.fm parsing failed
fi: last.fm:n parsiminen epäonnistui

source: %{u} doesn't exist on last.fm
fi: käyttäjää %{u} ei ole last.fm:ssä

source: error: %{e}
fi: virhe: %{e}

source: Super
fi: ylivertainen

source: Very High
fi: todella korkea

source: High
fi: korkea

source: Medium
fi: keskitasoa

source: Low
fi: matala

source: Very Low
fi: todella matala

source: %{a}'s and %{b}'s musical compatibility rating is %{bold}%{r}%{bold}%{common}
fi: käyttäjien %{a} ja %{b} musikaalinen yhteensopivuus on %{bold}%{r}%{bold}%{common}

source: and music they have in common includes: %{artists}
fi: , artisteja joita molemmat kuuntelevat ovat mm. %{artists}

source: %{user} doesn't exist on last.fm, perhaps they need to: lastfm user <username>
fi: käyttäjää %{user} ei ole last.fm:ssä, kenties henkilön %{user} pitäisi kertoa last.fm tunnuksensa botille: lastfm user <username>

source: %{u} hasn't played anything recently
fi: %{u} ei ole kuunnellut mitään hiljattain

source: is listening to
fi: kuuntelee

source: %{u} %{v} "%{t}" by %{a}%{b}
fi: %{u} %{v} artistin %{bold}%{a}%{bold} kappaletta "%{bold}%{t}%{bold}"%{b}

source: listened to
fi: kuunteli

source: %{u} %{v} "%{t}" by %{a}%{b} %{p}
fi: %{u} %{v} artistin %{bold}%{a}%{bold} kappaletta "%{bold}%{t}%{bold}"%{b} %{p}

source: ; see %{uri} for more
fi: ; lisätietoa osoitteessa %{uri}

source: I had problems getting info for %{a}
fi: hankaluuksia etsiessä tietoa kappaleesta %{a}

source: %{b}%{a}%{b} <%{u}> has been played %{b}%{c}%{b} times and is being listened to by %{b}%{l}%{b} people
fi: artistia %{b}%{a}%{b} <%{u}> on kuunneltu %{b}%{c}%{b} kertaa ja sillä on %{b}%{l}%{b} kuuntelijaa

source: . Tagged as: %{t}
fi: . Tagit: %{t}

source: . Similar artists: %{s}
fi: . Samanlaisia artisteja: %{s}

source: %{bold}%{t}%{bold} by %{bold}%{a}%{bold} (%{n} listeners)
fi: yhtyeen %{bold}%{a}%{bold} kapplae %{bold}%{t}%{bold} (%{n} kuuntelijaa)

source: track %{a} not found
fi: kappaletta %{a} ei löydy

source: %{b}%{name}%{b}, %{street}, %{u}%{city}%{u}, %{country}, see %{url} for more info
fi: %{b}%{name}%{b}, %{street}, %{u}%{city}%{u}, %{country}, lisätietoja osoitteessa %{url}

source: and %{maps} for maps
fi: ja kartta osoitteessa %{maps}

source: I had problems getting album info
fi: hankaluuksia saada albumin tietoja

source: I couldn't locate: "%{a}" by %{r}
fi: ei löytynyt yhtyeen %{r} albumia "%{a}"

source: the album "%{a}" by %{r} %{y}has been played %{c} times
fi: yhtyeen %{r} albumia "%{a}" on kuunneltu %{c} kertaa

source: okay, I'll remember that %{n} is %{u} on last.fm
fi: selvä, %{n} on siis %{u} last.fm:ssä

source: okay, I'll remember that %{n} prefers "%{r}" and "%{p}"
fi: selvä, tästä lähtien muistan että %{n} suosii verbejä "%{r}" ja "%{p}"

source: %{nick} is %{user} on last.fm
fi: %{nick} on %{user} last.fm:ssä

source: sorry, I don't know who %{n} is on last.fm, perhaps they need to: lastfm set user <username>
fi: anteeksi, mutta en tiedä kuka %{n} on last.fm:ssä, kenties hänen pitää kertoa last:fm tunnuksensa botille: lastfm set user <username>

source: no response body
fi: ongelmia last.fm:stä vastaanotetun datan kanssa

source: I had problems accessing last.fm: %{e}
fi: ongelmia last.fm:ään yhdistyksessä

source: %{user} has no friends :(
fi: käyttäjällä %{user} ei ole kavereita :(

source: %{user} has %{total} friends: %{friends}
fi: käyttäjällä %{user} on %{total} kaveria: %{friends}

source: %{user} has %{total} friends, including %{friends}%{seemore}
fi: käyttäjällä %{user} on %{total} kaveria, mm. %{friends}%{seemore}

source: %{user} has not loved any tracks
fi: %{user} ei ole rakastunut yhteenkään kappaleeseen

source: %{user} has loved %{total} tracks: %{tracks}
fi: %{user} on rakastunut %{total}:een kappaleeseen: %{tracks}

source: %{user} has loved %{total} tracks, including %{tracks}%{seemore}
fi: %{user} on rakastunut %{total}:een kappaleeseen, mm. %{tracks}%{seemore}

source: no one seems to share %{user}'s musical taste
fi: ilmeisesti kukaan ei pidä samanlaisesta musiikista kuin %{user}

source: %{user}'s musical neighbours are %{nbrs}
fi: käyttäjän %{user} musikaalisia naapureita ovat %{nbrs}

source: %{user}'s musical neighbours include %{nbrs}%{seemore}
fi: käyttäjän %{user} musikaalisia naapureita ovat mm. %{nbrs}%{seemore}

source: or more
fi: tai enemmän

source: %{user} hasn't played anything recently
fi: %{user} ei ole kuunnellut mitään hiljattain

source: %{user} has recently played %{tracks}
fi: %{user} on hiljattain kuunnellut %{tracks}

source: there are no shouts for %{user}
fi: käyttäjälle %{user} ei ole huutoja

source: %{user} hasn't played anything in this period of time
fi: %{user} ei ole kuunnellut mitään tällä aikavälillä
