Repository: jsn/rbot
Catalog: po/*/rbot-markov.po
Languages: it

source: markov is currently enabled, %{p}% chance of chipping in
it: markov è attualmente attivo, con una probabilità del %{prob}% di intervenire

source: , %{l} messages in queue
it: , %{l} messaggi in coda

source: , %{l} chains to upgrade
it: , %{l} catene da aggiornare

source: markov is currently disabled
it: markov è attualmente disabilitato

source: %{u} removed
it: %{u} rimosso

source: not found in list
it: non trovato nella lista

source: %{u} already in list
it: %{u} è già nella lista

source: %{u} added to markov ignore list
it: %{u} aggiunto alla lista da ignorare per markov

source: give the name of a person or channel to ignore
it: fornisci il nome della persona o del canale da ignorare

source: I'm ignoring %{ignored}
it: Sto ignorando %{ignored}

source: %{u} added to markov readonly list
it: %{u} aggiunto alla lista di sola lettura per markov

source: give the name of a person or channel to read only
it: fornisci il nome della persona o del canale da leggere solamente

source: I'm only reading %{readonly}
it: Sono in sola lettura %{readonly}

source: markov has a %{prob}% chance of chipping in
it: markov ha una probabilità del %{prob}% di intervenire

source: I can't :(
it: non posso :(

source: no such file
it: il file non esiste

source: the file is empty!
it: il file è vuoto!

source: example matches for that pattern at lines %{range} include: %{lines}
it: esempi di cattura per quel pattern nelle righe %{range}: %{lines}

source: the pattern doesn't match anything at lines %{range}
it: il patter non cattura nulla alle righe %{range}

source: learning from the file without a pattern would learn, for example:
it: imparare senza pattern dal file darebbe ad esempio:
