Repository: jsn/rbot
Catalog: po/*/rbot-shiritori.po
Languages: fr, ja

source: %{current_player}, it's your turn. %{previous_word} -> %{current_word}
fr: %{current_player}, c'est votre tour. %{previous_word} -> %{current_word}
ja: %{current_player} さんの番です。%{previous_word} -> %{current_word}

source: No one has given the first word yet. Say the first word to start.
fr: Personne n'a donnée le premier mot pour le moment. Dites le premier mot pour demarrer.
ja: しりとりの始めの言葉を教えてください。

source: Poor %{current_player} is playing alone! Anyone care to join? %{previous_word} -> %{current_word}
fr: Pauvre %{current_player} est en train de jouer seul! Personne ne veut se joindre? %{previous_word} -> %{current_word}
ja: %{current_player} さんは一人で寂しいでしょう。他の人もしりとりしませんか？%{previous_word} -> %{current_word}

source: %{player} took too long and is out of the game. Try again next game!
fr: %{player} prend trop de temps et est hors jeu. Essaye encore au prochain jeu!
ja: 残念ですが %{player} さんはタイムアウトで負けです。今度のゲームがんばってね！

source: %{player} is the last remaining player and the winner! Congratulations!
fr: %{player} est le dernier joueur et le gagnant! Felicitation!
ja: %{player} さんは勝者です！おめでとうございます！

source: %{player} took too long and skipped the turn.
fr: %{player} prend trop de temps et à sauter le tour.
ja: %{player} さんはタイムアウトで、番を飛びました。

source: %{player} has given the first word: %{word}
fr: %{player} à donné le premier mot: %{word}
ja: %{player} さんは始めの言葉を決めました：%{word}

source: Welcome to shiritori, %{player}.
fr: Bienvenue à shiritori, %{player}.
ja: しりとりへようこそ、%{player} さん

source: The word %{used_word} has been used. Retry from %{word}
fr: Le mot %{used_word} a déjà été utilisé. Reesaye depuis %{word}
ja: 「%{used_word}」はもう使った言葉なのでダメです。もう一度「%{word}」から続けてください。

source: It's impossible to continue the chain from %{word}. The game has ended. Thanks a lot, %{player}! :(
fr: Il est impossible de continuer la chaine depuis %{word}. Le jeu est terminé. Merci beaucoup, %{player}! :(
ja: %{player} さんが使った言葉「%{word}」からしりとりが続けられないので、ゲームが終わってしまいました。

source: It's impossible to continue the chain from %{bad_word}. Retry from %{word}
fr: Il est impossible de continuer la chaine depuis %{bad_word}. Reesaye depuis %{word}
ja: 「%{bad_word}」からしりとりが続けられないのでダメです。もう一度「%{word}」から続けてください。

source: It's impossible to continue the chain from %{word}. Start with another word.
fr: Il est impossible de continuer la chaine depuis %{word}. Commence avec un autre mot.
ja: 「%{word}」ではしりごりを始められないのです。他の言葉で始めてください。

source: A game in which each player must continue the previous player's word, by using its last one or few characters/letters of the word to start a new word. 'shiritori <ruleset>' => Play shiritori with a set of rules. Available rulesets: %{rulesets}. 'shiritori stop' => Stop the current shiritori game.
fr: Un jeu ou chaques joueurs doivent continuer le mot du joueur precedent, en utilisant au moins le dernier ou quelques caracteres/lettres du mot de demarrage pour recommencer un nouevau mot. 'shiritori <ruleset>' => Commence shiritori avec un set de regles. Regles disponnibles: %{rulesets}. 'shiritori stop' => Stoppe le shiritori en cours.
ja: しりとりのゲームです。shiritori <ruleset> => ルールセットを使ってゲームを始めます。使えるルールセットは%{rulesets}です。shiritori stop => 今のゲームを止めます。

source: Already playing shiritori here
fr: Shiritori déjà en cours
ja: もうすでにしりとりを遊んでいます

source: Shiritori has started. Please say the first word
fr: Shiritori est démarrer. Veuillez dire le premier mot
ja: しりとりが始まりました。始めの言葉を言ってください

source: couldn't start %{ruleset} shiritori: %{error}
fr: impossible de demarrer %{ruleset} shiritori: %{error}
ja: %{ruleset}のしりとりを始められませんでした。理由は： %{error}

source: There is no ruleset named %{ruleset}
fr: Il n'y a aucune règle nommée %{ruleset}
ja: 「%{ruleset}」というルールセットは知りません。

source: Shiritori has stopped. Hope you had fun!
fr: Shiritori est stoppé. C'etais super!
ja: しりとりのゲームが中止になりました。

source: No game to stop here, because no game is being played.
fr: Aucun jeu a stopper, car aucun jeu n'est en cours.
ja: しりとりのゲームをしていません。
